DROP DATABASE IF EXISTS test;

CREATE DATABASE test;

USE test;

CREATE TABLE `books`
(
	`id` INT(8) NOT NULL AUTO_INCREMENT,
	`title` VARCHAR(100) NOT NULL ,
    `description` VARCHAR(255) NOT NULL,
    `author` VARCHAR(100) NOT NULL,
    `isbn` VARCHAR(20) NOT NULL,
    `printYear`INT(4) NOT NULL,
    `readAlready` BIT(1) NOT NULL DEFAULT b'0',

    PRIMARY KEY (`id`)
)

DEFAULT CHARACTER SET='utf8';



INSERT INTO books (`title`, `description`, `author`, `isbn`, `printYear`, `readAlready`) VALUES

('Доктор Живаго', 'роман', 'Пастернак', '45', 1980, 0),
('Барбаросса', 'рассказ', 'Пикуль', '40', 1970, 0),
('Махабхарата', 'эпос', 'Вьяса', '5', 1960, 0),
('Мёртвые души', 'поэма', 'Гоголь', '77', 1930, 0),
('Идиот', 'роман', 'Достоевский', '80', 1999, 0),
('Сто лет одиночества', 'роман', 'Габриэль Гарсиа Маркес', '90', 1967, 0),
('Тропы по большому сертану', '-', 'Жуан Гимарайнс Роза', '100', 1966, 0),
('Илиада', 'поэма', 'Гомер', '110', 1980, 0),
('Братья Карамазовы', 'роман', 'Достоевский', '115', 1930, 1),
('Процесс', 'роман', 'Франц Кафка', '3', 1925, 1),
('За́мок', 'роман', 'Франц Кафка', '210', 1926, 0),
('Волшебная гора', 'роман', 'Томас Манн', '211', 1990, 0),
('Педро Парамо', 'роман', 'Хуан Рульфо', '155', 1955, 0),
('Старик и море', 'повесть', 'Эрнест Хемингуэй', '156', 1925, 0),
('Гамлет', 'трагедия', 'Уильям Шекспир', '301', 1903, 0),
('Гордость и предубеждение', 'роман', 'Джейн Остин', '212', 1913, 0),
('Король Лир', 'пьесса', 'Уильям Шекспир', '301', 1901, 0),
('Воспоминания Адриана', 'роман', 'Маргерит Юрсенар', '400', 1951, 0),
('Путешествия Гулливера', '-', 'Джонатан Свифт', '500', 1960, 0),
('Путешествие на край ночи', '-', 'Луи-Фердинанд Селин', '550', 1932, 0),
('Приключения Гекльберри Финна', 'роман', 'Марк Твен', '1000', 1994, 0),
('Красное и чёрное', 'роман', 'Стендаль', '999', 1961, 0)




